/*export const getAnimalTypes = (): Array<AnimalTypesType> => {
  return [
    {
      id: 0,
      name: 'Собаки',
      image: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 1,
      name: 'Кошки',
      image: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 2,
      name: 'Грызуны',
      image: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 3,
      name: 'Птицы',
      image: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 4,
      name: 'Рыбки',
      image: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
  ];
};*/
/*export const getProductsTypes = (): Array<resProductTypesType> => {
  return [
    { id: 0, name: 'Корм (сухой, влажный)', is_active: false },
    { id: 1, name: 'Лакомства', is_active: false },
    { id: 2, name: 'Игрушки', is_active: false },
    { id: 3, name: 'Наполнитель', is_active: false },
    { id: 4, name: 'Гигиена и уход', is_active: false },
    { id: 5, name: 'Ветеринарная диета', is_active: false },
    { id: 6, name: 'Амуниция, витамины', is_active: false },
    { id: 7, name: 'Миски', is_active: false },
    { id: 8, name: 'Туалеты', is_active: false },
    { id: 9, name: 'Домики', is_active: false },
    { id: 10, name: 'Когтеточки', is_active: false },
  ];
};*/
/*export const getArticles = (): Array<ArticleType> => {
  return [
    {
      id: 0,
      title: 'Обзор корма Hills (Хиллс) для собак',
      description: 'Продукция чешской компании «Хиллс» известна многим владельцам четвероногих питомцев. Она давно зарекомендовала себя на отечественном рынке. Рационы представлены...',
      timeForReading: 5,
      date: '17 марта 2022',
      img: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 1,
      title: 'Обзор корма Hills (Хиллс) для собак',
      description: 'Продукция чешской компании «Хиллс» известна многим владельцам четвероногих питомцев. Она давно зарекомендовала себя на отечественном рынке. Рационы представлены...',
      timeForReading: 5,
      date: '17 марта 2022',
      img: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 2,
      title: 'Обзор корма Hills (Хиллс) для собак',
      description: 'Продукция чешской компании «Хиллс» известна многим владельцам четвероногих питомцев. Она давно зарекомендовала себя на отечественном рынке. Рационы представлены...',
      timeForReading: 5,
      date: '17 марта 2022',
      img: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 3,
      title: 'Обзор корма Hills (Хиллс) для собак',
      description: 'Продукция чешской компании «Хиллс» известна многим владельцам четвероногих питомцев. Она давно зарекомендовала себя на отечественном рынке. Рационы представлены...',
      timeForReading: 5,
      date: '17 марта 2022',
      img: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 4,
      title: 'Обзор корма Hills (Хиллс) для собак',
      description: 'Продукция чешской компании «Хиллс» известна многим владельцам четвероногих питомцев. Она давно зарекомендовала себя на отечественном рынке. Рационы представлены...',
      timeForReading: 5,
      date: '17 марта 2022',
      img: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 5,
      title: 'Обзор корма Hills (Хиллс) для собак',
      description: 'Продукция чешской компании «Хиллс» известна многим владельцам четвероногих питомцев. Она давно зарекомендовала себя на отечественном рынке. Рационы представлены...',
      timeForReading: 5,
      date: '17 марта 2022',
      img: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 6,
      title: 'Обзор корма Hills (Хиллс) для собак',
      description: 'Продукция чешской компании «Хиллс» известна многим владельцам четвероногих питомцев. Она давно зарекомендовала себя на отечественном рынке. Рационы представлены...',
      timeForReading: 5,
      date: '17 марта 2022',
      img: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 7,
      title: 'Обзор корма Hills (Хиллс) для собак',
      description: 'Продукция чешской компании «Хиллс» известна многим владельцам четвероногих питомцев. Она давно зарекомендовала себя на отечественном рынке. Рационы представлены...',
      timeForReading: 5,
      date: '17 марта 2022',
      img: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 8,
      title: 'Обзор корма Hills (Хиллс) для собак',
      description: 'Продукция чешской компании «Хиллс» известна многим владельцам четвероногих питомцев. Она давно зарекомендовала себя на отечественном рынке. Рационы представлены...',
      timeForReading: 5,
      date: '17 марта 2022',
      img: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 9,
      title: 'Обзор корма Hills (Хиллс) для собак',
      description: 'Продукция чешской компании «Хиллс» известна многим владельцам четвероногих питомцев. Она давно зарекомендовала себя на отечественном рынке. Рационы представлены...',
      timeForReading: 5,
      date: '17 марта 2022',
      img: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 10,
      title: 'Обзор корма Hills (Хиллс) для собак',
      description: 'Продукция чешской компании «Хиллс» известна многим владельцам четвероногих питомцев. Она давно зарекомендовала себя на отечественном рынке. Рационы представлены...',
      timeForReading: 5,
      date: '17 марта 2022',
      img: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 11,
      title: 'Обзор корма Hills (Хиллс) для собак',
      description: 'Продукция чешской компании «Хиллс» известна многим владельцам четвероногих питомцев. Она давно зарекомендовала себя на отечественном рынке. Рационы представлены...',
      timeForReading: 5,
      date: '17 марта 2022',
      img: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 12,
      title: 'Обзор корма Hills (Хиллс) для собак',
      description: 'Продукция чешской компании «Хиллс» известна многим владельцам четвероногих питомцев. Она давно зарекомендовала себя на отечественном рынке. Рационы представлены...',
      timeForReading: 5,
      date: '17 марта 2022',
      img: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 13,
      title: 'Обзор корма Hills (Хиллс) для собак',
      description: 'Продукция чешской компании «Хиллс» известна многим владельцам четвероногих питомцев. Она давно зарекомендовала себя на отечественном рынке. Рационы представлены...',
      timeForReading: 5,
      date: '17 марта 2022',
      img: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 14,
      title: 'Обзор корма Hills (Хиллс) для собак',
      description: 'Продукция чешской компании «Хиллс» известна многим владельцам четвероногих питомцев. Она давно зарекомендовала себя на отечественном рынке. Рационы представлены...',
      timeForReading: 5,
      date: '17 марта 2022',
      img: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 15,
      title: 'Обзор корма Hills (Хиллс) для собак',
      description: 'Продукция чешской компании «Хиллс» известна многим владельцам четвероногих питомцев. Она давно зарекомендовала себя на отечественном рынке. Рационы представлены...',
      timeForReading: 5,
      date: '17 марта 2022',
      img: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
  ];
};*/
/*export const getReviews = (): Array<ReviewsType> => {
  return [
    {
      id: 0,
      nameAuthor: 'Меженная Марина Мельников Руслан',
      bodyOfComment: 'Мы являемся хозяевами замечательного голден ретривера по кличке Умка. Своего пса мы очень любим, хотим видеть его красивым и здоровым, а потому к выбору корма подошли ответственно: прочитали соответствующую литературу, изучили составы различных кормов, проконсультировались у заводчиков. В результате свой выбор остановили на Акане: это сбалансированный корм с высоким содержанием протеинов, но без «разбухающих» зерновых культур. Сейчас Умке два с половиной года и в течение последних полутора лет мы кормим его «Acana Grasslands» с лососем и ягненком. Да, корм недешевый, но мы ни разу не пожалели о своем выборе: Умка в отличной форме, а главное – он получает все необходимые питательные вещества и микроэлементы в нужном количестве. Аллергических реакций на корм замечено не было. Вобщем, кормом мы довольны!',
      phoneNumber: '+375 44 672 23 43',
      nameAnimal: 'собака умка',
    },
    {
      id: 1,
      nameAuthor: 'Меженная Марина Мельников Руслан',
      bodyOfComment: 'Мы являемся хозяевами замечательного голден ретривера по кличке Умка. Своего пса мы очень любим, хотим видеть его красивым и здоровым, а потому к выбору корма подошли ответственно: прочитали соответствующую литературу, изучили составы различных кормов, проконсультировались у заводчиков. В результате свой выбор остановили на Акане: это сбалансированный корм с высоким содержанием протеинов, но без «разбухающих» зерновых культур. Сейчас Умке два с половиной года и в течение последних полутора лет мы кормим его «Acana Grasslands» с лососем и ягненком. Да, корм недешевый, но мы ни разу не пожалели о своем выборе: Умка в отличной форме, а главное – он получает все необходимые питательные вещества и микроэлементы в нужном количестве. Аллергических реакций на корм замечено не было. Вобщем, кормом мы довольны!',
      phoneNumber: '+375 44 672 23 43',
      nameAnimal: 'собака умка',
    },
    {
      id: 2,
      nameAuthor: 'Меженная Марина Мельников Руслан',
      bodyOfComment: 'Мы являемся хозяевами замечательного голден ретривера по кличке Умка. Своего пса мы очень любим, хотим видеть его красивым и здоровым, а потому к выбору корма подошли ответственно: прочитали соответствующую литературу, изучили составы различных кормов, проконсультировались у заводчиков. В результате свой выбор остановили на Акане: это сбалансированный корм с высоким содержанием протеинов, но без «разбухающих» зерновых культур. Сейчас Умке два с половиной года и в течение последних полутора лет мы кормим его «Acana Grasslands» с лососем и ягненком. Да, корм недешевый, но мы ни разу не пожалели о своем выборе: Умка в отличной форме, а главное – он получает все необходимые питательные вещества и микроэлементы в нужном количестве. Аллергических реакций на корм замечено не было. Вобщем, кормом мы довольны!',
      phoneNumber: '+375 44 672 23 43',
      nameAnimal: 'собака умка',
    },
    {
      id: 3,
      nameAuthor: 'Меженная Марина Мельников Руслан',
      bodyOfComment: 'Мы являемся хозяевами замечательного голден ретривера по кличке Умка. Своего пса мы очень любим, хотим видеть его красивым и здоровым, а потому к выбору корма подошли ответственно: прочитали соответствующую литературу, изучили составы различных кормов, проконсультировались у заводчиков. В результате свой выбор остановили на Акане: это сбалансированный корм с высоким содержанием протеинов, но без «разбухающих» зерновых культур. Сейчас Умке два с половиной года и в течение последних полутора лет мы кормим его «Acana Grasslands» с лососем и ягненком. Да, корм недешевый, но мы ни разу не пожалели о своем выборе: Умка в отличной форме, а главное – он получает все необходимые питательные вещества и микроэлементы в нужном количестве. Аллергических реакций на корм замечено не было. Вобщем, кормом мы довольны!',
      phoneNumber: '+375 44 672 23 43',
      nameAnimal: 'собака умка',
    },
    {
      id: 4,
      nameAuthor: 'Меженная Марина Мельников Руслан',
      bodyOfComment: 'Мы являемся хозяевами замечательного голден ретривера по кличке Умка. Своего пса мы очень любим, хотим видеть его красивым и здоровым, а потому к выбору корма подошли ответственно: прочитали соответствующую литературу, изучили составы различных кормов, проконсультировались у заводчиков. В результате свой выбор остановили на Акане: это сбалансированный корм с высоким содержанием протеинов, но без «разбухающих» зерновых культур. Сейчас Умке два с половиной года и в течение последних полутора лет мы кормим его «Acana Grasslands» с лососем и ягненком. Да, корм недешевый, но мы ни разу не пожалели о своем выборе: Умка в отличной форме, а главное – он получает все необходимые питательные вещества и микроэлементы в нужном количестве. Аллергических реакций на корм замечено не было. Вобщем, кормом мы довольны!',
      phoneNumber: '+375 44 672 23 43',
      nameAnimal: 'собака умка',
    },
  ];
};*/
/*export const getBrands = (): Array<ResBrandType> => {
  return [
    {
      id: 0,
      name: 'AIRYVEST',
      image: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 1,
      name: 'BIOMILL',
      image: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 2,
      name: 'CAMON',
      image: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 3,
      name: 'CAT STEP',
      image: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 4,
      name: 'DENNERLE',
      image: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 5,
      name: 'ELATO',
      image: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 6,
      name: 'FIBRE FAMILY',
      image: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 7,
      name: 'GIMDOG',
      image: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 8,
      name: 'HAPPY FRIENDS',
      image: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 9,
      name: 'PURINA',
      image: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 10,
      name: 'PURINA',
      image: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 11,
      name: 'PURINA',
      image: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 12,
      name: 'PURINA',
      image: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 13,
      name: 'PURINA',
      image: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 14,
      name: 'PURINA',
      image: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 15,
      name: 'PURINA',
      image: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 16,
      name: 'PURINA',
      image: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 17,
      name: 'PURINA',
      image: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
  ];
};*/

import { AxiosRequestConfig, AxiosResponseHeaders } from 'axios';
import { ProductItemType } from '../redux/reducers/products-reducer';

export const getProductItems = (): Array<resProductItemType> => {
  return [
    {
      id: 1,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
        {
          id: 57,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 2,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
        {
          id: 57,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 3,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
        {
          id: 57,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 4,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
        {
          id: 57,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 5,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
        {
          id: 57,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 6,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
        {
          id: 57,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 7,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
        {
          id: 57,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 8,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
        {
          id: 57,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 9,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
        {
          id: 57,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 10,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
        {
          id: 57,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 11,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
        {
          id: 57,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 12,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
        {
          id: 57,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 13,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
        {
          id: 57,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 14,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
        {
          id: 57,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 15,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
        {
          id: 57,
          image: 'https://www.purinaone.ru/dog/sites/default/files/2021-11/shutterstock_1155759124_OG_1.jpg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
  ];
};
export const getWithThisProductsBuy = (): Array<resProductItemType> => {
  return [
    {
      id: 1,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t6.jpeg',
        },
        {
          id: 57,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t2.jpeg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 2,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t6.jpeg',
        },
        {
          id: 57,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t2.jpeg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 3,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t6.jpeg',
        },
        {
          id: 57,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t2.jpeg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 4,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t6.jpeg',
        },
        {
          id: 57,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t2.jpeg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 5,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t6.jpeg',
        },
        {
          id: 57,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t2.jpeg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 6,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t6.jpeg',
        },
        {
          id: 57,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t2.jpeg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 7,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t6.jpeg',
        },
        {
          id: 57,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t2.jpeg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 8,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t6.jpeg',
        },
        {
          id: 57,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t2.jpeg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 9,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t6.jpeg',
        },
        {
          id: 57,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t2.jpeg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 10,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t6.jpeg',
        },
        {
          id: 57,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t2.jpeg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 11,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t6.jpeg',
        },
        {
          id: 57,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t2.jpeg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 12,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t6.jpeg',
        },
        {
          id: 57,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t2.jpeg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 13,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t6.jpeg',
        },
        {
          id: 57,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t2.jpeg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 14,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t6.jpeg',
        },
        {
          id: 57,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t2.jpeg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
    {
      id: 15,
      name: 'Health Nutrition',
      animal: [
        {
          'id': 1,
          'name': 'Собаки',
          'image': 'http://127.0.0.1:8000/media/photos_animal/Y/M/image_10_4.png',
        },
      ],
      brand: {
        id: 1,
        name: 'Royal Canin',
        image: 'http://127.0.0.1:8000/media/photos_brand/Y/M/3-royal-canin-kitten_for_kittens_to_12_months.jpg',
      },
      category: {
        id: 1,
        name: 'Сухой Корм',
        is_active: true,
      },
      options: [
        {
          id: 156,
          units: {
            unit_name: 'шт.',
          },
          article_number: '405',
          partial: false,
          quantity: 1,
          price: '2.00',
          size: 12,
          stock_balance: 2,
        },
        {
          id: 153,
          units: {
            unit_name: "шт."
          },
          article_number: "404",
          partial: false,
          quantity: 1,
          price: "20.00",
          size: 30,
          stock_balance: 12
        }
      ],
      chosen_option: {
        id: 156,
        units: {
          unit_name: 'шт.',
        },
        article_number: '405',
        partial: false,
        quantity: 1,
        price: '2.00',
        size: 12,
        stock_balance: 2,
      },
      images: [
        {
          id: 56,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t6.jpeg',
        },
        {
          id: 57,
          image: 'http://127.0.0.1:8000/media/photos_products/Y/M/t2.jpeg',
        },
      ],
      description: 'Полнорационный сухой корм для кастрированных котов и стерилизованных кошек от 1 до 7 лет. После стерилизации (кастрации) поведение кошек меняется, и их питание должно соответствовать новым специфическим потребностям. Дело в том, что эти кошки не отличаются высокой активностью, потребляют меньше жидкости и, соответственно, у них реже частота мочеиспусканий и повышена концентрация мочи.Контроль веса. После стерилизации у кошек уменьшаются энергетические потребности.',
      features: '\r\n\tSTERILISED 37 помогает снизить риск появления избыточного веса благодаря умеренному содержанию жиров, при соблюдении рекомендуемых норм кормления.\r\n\tПоддержание здоровья мочевыделительной системы. Помогает поддерживать здоровье мочевыделительной системы благодаря балансу минеральных веществ.\r\n\tПоддержание мышечной массы благодаря высокому содержанию белков. Способствует поддержанию мышечной массы благодаря высокому уровню белков.\r\n\tОбогащен L-карнитином. L-карнитин необходим для нормального обмена жиров.\r\n\r\n\r\nFELINE HEALTH NUTRITION &ndash; гамма продуктов повседневного питания для здоровых кошек, учитывающая их потребности обусловленные возрастом, образом жизни и другими индивидуальными особенностями.',
      composition: 'Дегидратированные белки животного происхождения (птица), изолят растительных белков*, пшеница, мука из зерновых культур, растительная клетчатка, животные жиры, гидролизат белков животного происхождения (вкусоароматические добавки), рис, минеральные вещества, рыбий жир, дрожжи и побочные продукты брожения, соевое масло, фруктоолигосахариды, хлорид аммония.',
      additives: 'Витамин A &ndash; 19 000 ME, витамин D3 &ndash; 1 000 ME, железо - 34 мг, йод &ndash; 3,4 мг, марганец - 44 мг, цинк &ndash; 131 мг, селен &ndash; 0,05 мг.\r\nТехнологические добавки: клиноптилолит осадочного происхождения &ndash; 10 гр, консерванты &ndash; антиокислители.\r\nРекомендации по кормлению: см. упаковку.\r\nСледите, чтобы у Вашего питомца всегда был доступ к чистой свежей воде.',
      analysis: '\r\n\tБелки &ndash; 37 %\r\n\tЖиры &ndash; 12 %\r\n\tКлетчатка &ndash; 6,2 %\r\n\tМинеральные вещества &ndash; 8,2 %\r\n\tБезазотистые экстрактивные вещества &ndash; 31,1 %\r\n',
    },
  ];
};
export const getDiscounts = (): Array<DiscountType> => {
  return [
    {
      id: 0,
      title: 'Скидка 25% на первый заказ любого товара на сумму от 50BYN',
      img: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
    {
      id: 1,
      title: 'Получите игрушку в подарок при сумме заказа от 200BYN',
      img: 'https://res.cloudinary.com/dk-find-out/image/upload/q_80,w_1920,f_auto/580540_mjznrj.jpg',
    },
  ];
};
export const getProductInitState = (): ProductItemType => {
  return {id: 0,
    name: '',
    animal: [{ id: 0, name: '', image: '' }],
    images:  [{id: 0, image: ''}],
    description: '',
    features: '',
    composition: '',
    additives: '',
    analysis: '',
    brand: { id: 0, name: '', image: '' },
    category: { id: 0, name: '', is_active: true } ,
    options: [{
      id: 0,
      article_number: '',
      partial: false,
      quantity: 0,
      price: '',
      size: 0,
      stock_balance: 0,
      units: { unit_name: '' },
    }],
    chosen_option: {
      id: 0,
      article_number: '',
      partial: false,
      quantity: 0,
      price: '',
      size: 0,
      stock_balance: 0,
      units: { unit_name: '' },
    },}
}

export type DiscountType = {
  id: number,
  title: string,
  img: string
}
export type ResBrandType = {
  id: number,
  name: string,
  image: string,
}
export type OptionType = {
  id: number,
  article_number: string,
  /*discountproductoption: {
    title: string,
    discount_amount: number,
    product_option: string
  },*/
  partial: boolean,
  quantity: number,
  price: string,
  size: number,
  stock_balance: number,
  units: { unit_name: string },
}
export type ArticleType = {
  id: number,
  title: string,
  description: string,
  time_read: number,
  date_added: string,
  image: string,
  is_active: boolean,
  animals: number
}
export type ReviewsType = {
  id: number,
  name_author: string,
  body_of_comment: string,
  phone_number: string,
  name_animal: string,
}
export type AnimalTypesType = {
  id: number,
  name: string,
  image: string,
}
export type resProductItemType = {
  id: number,
  name: string,
  animal: Array<AnimalTypesType>
  images: Array<{ id: number, image: string }>,
  description: string,
  features: string,
  composition: string,
  additives: string,
  analysis: string,
  brand: { id: number, name: string, image: string },
  category: { id: number, name: string, is_active: true, },
  options: Array<OptionType>,
 /* discountproduct: {
    title: string,
    discount_amount: number,
    product_id: number
  } | null,*/
  chosen_option: OptionType
}
export type responseProductItemType = {
  page_number: number,
  products_on_page: number,
  total_products: number,
  total_pages: number,
  max_products_on_page: number,
  results: Array<resProductItemType>
}
export type AxiosResponse<T = any, D = any> = {
  data: T,
  status: number;
  statusText: string;
  headers: AxiosResponseHeaders;
  config: AxiosRequestConfig<D>;
  request?: any;
}
export type resProductTypesType = {
  id: number,
  name: string,
  is_active: boolean
}
export type ShopInfoType = {
  id: number,
  address: string,
  metro: string,
  time_weekdays: string,
  time_weekend: string,
  phone_number: string,
  social: string,
  maps: string,
  photo: string,
  description_shop: {
    title: string,
    main_info: string
  },
  second_info: Array<{
    id: number,
    info_title: string,
    info_text: string
  }>
}

